app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("created_at", "email", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-08-25 23:56:31.054431"], ["email", "drod@spurs.com"], ["name", "Dennis Rodman"], ["updated_at", "2014-08-25 23:56:31.054431"], ["user_id", 2]]
---
  def create
    contact = Contact.new(contact_params)

    if contact.save

SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    render json: Contact.find(params[:id])

SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "contacts" SET "email" = ?, "name" = ?, "updated_at" = ?, "user_id" = ? WHERE "contacts"."id" = 4  [["email", "drod@NBAHOF.com"], ["name", "Dennis the Meance"], ["updated_at", "2014-08-25 23:59:37.753675"], ["user_id", 3]]
---
  def update
    contact = Contact.find(params[:id])

    if contact.update(contact_params)

SELECT  "contacts".* FROM "contacts"  WHERE "contacts"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "contacts" WHERE "contacts"."id" = ?  [["id", 4]]
---
  def destroy
    contact = Contact.find(params[:id])
    contact.destroy!