app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", "2014-08-25 23:45:58.795928"], ["updated_at", "2014-08-25 23:45:58.795928"], ["username", "Dennis Rodman"]]
---
  def create
    user = User.new(user_params)

    if user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
UPDATE "users" SET "updated_at" = ?, "username" = ? WHERE "users"."id" = 4  [["updated_at", "2014-08-25 23:50:20.642450"], ["username", "Dennis The Menace"]]
---
  def update
    user = User.find(params[:id])

    if user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 13]]
---
  def destroy
    user = User.find(params[:id])
    user.destroy!